of-run/damBreakMod/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.146;

vertices
(
    (0 0 0)
    (2 0 0)
    (2.16438 0 0)
    (3 0 0)
    (0 0.32876 0)
    (2 0.32876 0)
    (2.16438 0.32876 0)
    (3 0.32876 0)
    (0 4 0)
    (2 4 0)
    (2.16438 4 0)
    (3 4 0)
    (0 0 0.1)
    (2 0 0.1)
    (2.16438 0 0.1)
    (3 0 0.1)
    (0 0.32876 0.1)
    (2 0.32876 0.1)
    (2.16438 0.32876 0.1)
    (3 0.32876 0.1)
    (0 4 0.1)
    (2 4 0.1)
    (2.16438 4 0.1)
    (3 4 0.1)
    (3.5 0 0)
    (4.5 0 0)
    (3.5 0.32876 0)
    (4.5 0.32876 0)
    (3.5 4 0)
    (4.5 4 0)
    (3.5 0 0.1)
    (4.5 0 0.1)
    (3.5 0.32876 0.1)
    (4.5 0.32876 0.1)
    (3.5 4 0.1)
    (4.5 4 0.1)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (23 16 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (19 16 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (23 84 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (4 84 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (19 84 1) simpleGrading (1 1 1)

    hex (3 24 26 7 15 30 32 19) (19 16 1) simpleGrading (1 1 1)
    hex (24 25 27 26 30 31 33 32) (19 16 1) simpleGrading (1 1 1)

    hex (26 27 29 28 32 33 35 34) (19 84 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
//*            (7 19 15 3)
//*            (11 23 19 7)
            (27 33 31 25)
            (29 35 33 27)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
            (2 3 15 14)

            (3 24 30 15)
            (24 25 31 30)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (7 19 23 11)
            (7 26 32 19)
            (26 28 34 32)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)

            (28 34 35 29)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
